app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Yes!"], ["content", "Aasdijaslkd"], ["author", "Ethan"], ["created_at", "2019-02-22 22:37:27.813258"], ["updated_at", "2019-02-22 22:37:27.813258"]]